01-technical_support_fundamentals/01-intro_it.md
<!-- START doctoc generated TOC please keep comment here to allow auto update -->
<!-- DON'T EDIT THIS SECTION, INSTEAD RE-RUN doctoc TO UPDATE -->
**Table of Contents**

- [Table of Contents](#table-of-contents)
- [Introduction to IT Support](#introduction-to-it-support)
  - [What is IT?](#what-is-it)
    - [Digital Divide](#digital-divide)
  - [Role of IT Support Specialist](#role-of-it-support-specialist)
    - [Managing](#managing)
    - [Installing](#installing)
    - [Maintaining](#maintaining)
    - [Troubleshooting](#troubleshooting)
    - [Configuring](#configuring)
- [History of Computing](#history-of-computing)
  - [From Abacus to Analytical Engine](#from-abacus-to-analytical-engine)
    - [Computer](#computer)
    - [Abacus](#abacus)
    - [Mechanical Engine of 17th Century](#mechanical-engine-of-17th-century)
    - [Invention of Punch Cards in 18th century shaped the world of computing](#invention-of-punch-cards-in-18th-century-shaped-the-world-of-computing)
    - [Charles Babbage invented the Difference Engine](#charles-babbage-invented-the-difference-engine)
    - [Analytical Engine](#analytical-engine)
    - [Invention of Algorithms](#invention-of-algorithms)
    - [Algorithm](#algorithm)
- [Digital Logic](#digital-logic)
  - [Computer Language](#computer-language)
    - [Binary System](#binary-system)
  - [Character Encoding](#character-encoding)
    - [ASCII](#ascii)
    - [UTF-8](#utf-8)
  - [Binary](#binary)
    - [Logic gates](#logic-gates)
  - [How to Count in Binary?](#how-to-count-in-binary)
- [Computer Architecture layer](#computer-architecture-layer)
  - [Abstraction](#abstraction)
  - [Software layer](#software-layer)
  - [User](#user)

<!-- END doctoc generated TOC please keep comment here to allow auto update -->

---
# Introduction to IT Support

## What is IT?

The use of digital technology, like computers and the internet, to store and process data into useful information.


### Digital Divide

The lack of digital literacy among the masses.


---

## Role of IT Support Specialist


### Managing


### Installing


### Maintaining


### Troubleshooting


### Configuring


---

# History of Computing

## From Abacus to Analytical Engine


### Computer

A device that stores and process data performing calculations.


### Abacus

The oldest known computer invented in 500 BC to count large numbers.


### Mechanical Engine of 17th Century

It was able to perform summation, subtraction, multiplication and division but still need human intervention to operate its knob and levers.


### Invention of Punch Cards in 18th century shaped the world of computing


### Charles Babbage invented the Difference Engine

It was a combination of sophisticated mechanical calculators and was able to perform pretty complex mathematical operations but not much else.


### Analytical Engine

Babbage followed it Difference Engine with Analytical Engine, he was inspired by Punch Cards, and it was able to perform automatic calculations without human interaction.

But it was still a giant Mechanical Computer though being impressive.


### Invention of Algorithms

A Mathematician Ada Lovelace realize the true potential of the Analytical Engine. She was the first person to recognize that a machine can be used more than just for pure calculations. She developed the first algorithm for the Engine.

Because of this discovery of Lovelace, the Analytical Engine became the first general purpose computing device in the history.


### Algorithm

A series of steps that solve specific problems.


---

# Digital Logic

## Computer Language


### Binary System

The communication that a computer uses, also known as a base-2 numeral system.

1.  Bit

    A number in binary.

2.  Byte

    A group of 8-bits.
    
    Examples:
    10100011, 11110011, 00001111

3.  Each bit can store one character, and we can have 256 possible values thanks to the base-2 system (2\*\*8)


---

## Character Encoding

Assigns our binary values to characters, so that we as human can read them.


### ASCII

The oldest used character encoding system for English alphabet, digits,  punctuation marks.


### UTF-8

The most prevalent encoding standard used today. Along with same ASCII table, it lets us use variable number of bytes.


---

## Binary

As in Punch Card systems , a hole represents the number 1, and no-hole represents the number 0.

In binary, electrical circuits are used to represent zeros and ones (0s,1s), when current passes through the circuit, the circuit is on and it represents 1, when no electricity passes, the circuit is closed and represents 0.


### Logic gates

Allow our transistors to do more complex tasks, like decide where to send electrical signals depending on logical conditions.

1.  AND logic gate

2.  OR logic gate

3.  NOT logic gate

4.  XOR logic gate

5.  SAND logic gate

6.  XNOR logic gate


---

## How to Count in Binary?

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">256</th>
<th scope="col" class="org-right">128</th>
<th scope="col" class="org-right">64</th>
<th scope="col" class="org-right">28</th>
<th scope="col" class="org-right">16</th>
<th scope="col" class="org-right">8</th>
<th scope="col" class="org-right">4</th>
<th scope="col" class="org-right">2</th>
<th scope="col" class="org-right">unit(0,1)</th>
<th scope="col" class="org-right">Decimal System</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
</tr>


<tr>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
</tr>


<tr>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">1</td>
<td class="org-right">0</td>
<td class="org-right">2</td>
</tr>


<tr>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">3</td>
</tr>


<tr>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">1</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">4</td>
</tr>


<tr>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">1</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">5</td>
</tr>


<tr>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">0</td>
<td class="org-right">6</td>
</tr>


<tr>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">7</td>
</tr>


<tr>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">1</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">8</td>
</tr>


<tr>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">1</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">9</td>
</tr>


<tr>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">1</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">0</td>
<td class="org-right">10</td>
</tr>
</tbody>
</table>


---

# Computer Architecture layer

## Abstraction

&rsquo;To take a relatively complex system and simplify it for our use.&rsquo;

We don&rsquo;t interact with the computers in the form of 0s and 1s(we actually do), instead an abstraction layer like, keyboard, mouse, error messages instead of showing bunch machine code etc.


---

## Software layer

How we as human interact with out computer.


---

## User

User interacts with a computer. One can operate, maintain, and even program the computer.
